Revit 2027 API
FamilySizeTableManager.ExportSizeTable Method
 Exports the size table to aCSV file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ExportSizeTable(
	string tableName,
	string filePath
)
Public Function ExportSizeTable (
	tableName As String,
	filePath As String
) As Boolean
public:
bool ExportSizeTable(
	String^ tableName,
	String^ filePath
)
member ExportSizeTable :
        tableName : string *
        filePath : string -> bool
Parameters
tableName String
 The bool name to export.
filePath String
 The CSV file to export to.
Return Value
Boolean
 True if successful, false otherwise..
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FamilySizeTableManager Class
Autodesk.Revit.DB Namespace